
if GetLocale() ~= "ruRU" then return end

select(2, ...).NPCs = {
	-- NPC's plates as icons
	["Боевой штандарт Альянса"] = "Alliance Battle Standard", 
	["Боевой штандарт клана Грозовой Вершины"] = "Alliance Battle Standard", 
	["Боевой штандарт Орды"] = "Horde Battle Standard",
	["Боевой штандарт клана Северного Волка"] = "Horde Battle Standard",
	["Исчадие Тьмы"] = "Shadowfiend",
	["Дух волка"] = "Spirit Wolf",
	["Элементаль воды"] = "Water Elemental",
	["Древень"] = "Treant",
	-- NPC's plates hidden
	["Вурдалак из войска мертвых"] = "",
	["Предсказательница ярмарки Новолуния"] = "",
	["Дрикс Злобноверт"] = "",
	["Гнимо"] = "",
	["Хакмуд из Аргуса"] = "",
	["Проекция верховного мага Варгота"] = "",
	["Бес в шаре"] = "",
	["Моджодишу"] = "",
	["Восставший вурдалак"] = "",
	["Тотем духов"] = "",
    ["Ядовитая змея"] = "",
	["Гадюка"] = "",
	["Зеркальное изображение"] = "",
	["Плакальщица Сильваны"] = "",
}